Option Explicit
	Dim V7 ' создание окна запуска 1С
	Dim OPENDB ' открытие базы
	Dim PathToBase ' путь к базе
	Dim UserName 'Имя пользователя 
	Dim UserPass 'Пароль пользователя 
	'**************************************************************************************************
	'->> НАСТРОЙКИ СКРИПТА
	'**************************************************************************************************
	'имя пользователя 
	UserName = " Autodesk "
	'пароль пользователя 
	UserPass = " 14789632 "
	' путь к базе
	PathToBase = " D:\DB77\LADU_Welle "
	'**************************************************************************************************
	'<<- НАСТРОЙКИ СКРИПТА (окончание)
	'**************************************************************************************************
	
	Set V7 = CreateObject("V77.Application")
	OPENDB = V7.Initialize(V7.RMTrade, " /d " & PathToBase & " /N " & UserName & " /P " & UserPass & " ", "NO_SPLASH_WINDOW")
